{
    "title": "The Plan of Life",
    "date": "1st July, 2020",
    "blogContent": "<div id=\"main-content\"><p>Have you ever felt that you are stuck in life? Like, you are just passing your time without extracting any meaningful experience or a fulfilling sense of purpose? Lately I am feeling so. Actually, I have been feeling this way for a while now. Life has often been metaphorically represented as a boat in an ocean, and you are the one sailing the boat. Your plans and ambitions are the oars which help you guide your boat to its destination. But what if you have reached your destination? Your oars are all but a memory now and your boat is anchored against the dock. You stand on the land which used to be your goal, your purpose. But now that you are here, you are again lost. You have enjoyed the feeling of being on land, having a solid bed with a roof to sleep under, but now what? Where are you supposed to go from here? Life is supposed to be a journey and this is definitely not the end, blimey, this is not even halfway through the journey. Then what is this feeling? What is this longing for?</p><p>Don't get me wrong, I am not saying that what I have right now, in this very moment, is all what I had planned for. I still have dreams, I still want to own a <a href=\"https://www.jaguar.in/jaguar-range/xe/index.html\">Jaguar XE/XF</a>, I still want to witness the <a href=\"http://www.chiangmai.bangkok.com/info/yee-peng-festival.htm\">Yee Peng</a> festival, I still want to travel the world, I still want to do humanitarian work, I still want to fall in love and I still want to take care of my parents. Besides being there for my family, I just don't think the others drive a similar passion in me as the one which guided me to my current self. Do you remember the time we were preparing for college admissions or when we were preparing for placements? Or when we were working on a project, professional or personal? We used to have such razor focus in what we were doing. We studied, planned, executed the plan with such precision and dedication. Nothing else mattered to us then. I miss those times when we really knew what we had to do, and we were so busy doing exactly that, that we didn't have time to think about life's great philosophical questions.</p><p>I think, these days we live for shorter dreams, or live without any dreams at all. Getting a promotion, receiving praises from family and friends, doing better than your colleagues, buying the tech gadget we always wanted to have, just doing and having whatever we ever dreamt of. But I have realised that these just give us short term pleasures. We'll be happy for a day or a week at max, and then life would return to its old, drab self. The question is, what gives us true happiness or rather true satisfaction?</p><p>This brings us to a bigger question, what is the purpose of life? Is it survival? Is it about giving back to others ? Or, is it a quest for the truth about life itself? I think the answer takes on different layers based on the person asking the question. From early childhood, goals are set for us, paths are carved out, and we just follow them until we either achieve it or fall short of it. In either case, the consciousness of life hits us late. For those of us who fall short of their goals, it's a turning point, a crushing reality dawns on us, goals are reset and some major life decisions are made. Life gets a bit more conspicuous for us. However, those of us who achieve the goals set for them, partially or fully, eventually become lost. We rejoice in our success, and feel that we have achieved everything, and we'll live happily ever after. But human mind is not made to slack-off, it needs a constant nudge, a constant direction. We struggle to hold on to a guiding rope, to help us move forward in life, to find another path for us. And the realisation that no one is there to carve the path can be petrifying.</p><p>The void. There is a void inside all of us, and we all keep searching unconsciously to fill it. Some of us do find their calling, and they eventually carry out great deeds, maybe not fashionable deeds, but great deeds indeed. If I talk about myself, I have always had this thing with me that I have to stand out from others, do things my own way. So when I was in my final year at college and we were all hoping and preparing to get placed in a respectable company, I was sure that I wasn't ready for the corporate life, that I couldn't work under someone and be ordered around. But ultimately, life ran its course and here I am working in a company known for its corporate culture. I still don't love it but I have come at terms with it, I still get the urges to defy my manager and do things my way, and sometimes I follow it through too. My calling hasn't found me yet. I am lost in land which I thought I knew, but it gets less and less familiar, as I trod through. Numerous paths lay before me, and I have been taking the path commonly travelled. Frost mocks me with <span style=\"font-style: italic;\">The Road Not Taken</span>, and I hope to have the courage someday to break free, carve my own path. Maybe someday, along the mall road in Mussorie, you'll find me running a cafe, selling pizzas and fries, and bearing the name <span style=\"font-weight: bold;\">'A Beautiful Encounter'</span>.</p></div>"
}